## staging: pinpoint_to_sqs_sms_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 19 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                        NAME                                         |
|--------|-------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.pinpoint-sms-failures-carriers[0]`                |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-bell-warning[0]`                 |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-bragg-warning[0]`                |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-freedom-warning[0]`              |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-iristel-warning[0]`              |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-maritime-warning[0]`             |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-mts-warning[0]`                  |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-rogers-warning[0]`               |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-telus-warning[0]`                |
|        | `aws_cloudwatch_metric_alarm.pinpoint-sms-failures-videotron-warning[0]`            |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-blocked-as-spam[0]`                   |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-carrier-dwell-times[0]`               |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-failures-by-carrier[0]`               |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-get-failures[0]`                      |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-get-logs[0]`                          |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-get-sms-logs-by-dest-phone-number[0]` |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-get-sms-logs-by-orig-phone-number[0]` |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-international-sending-status[0]`      |
|        | `aws_cloudwatch_query_definition.pinpoint-sms-success-vs-unreachable[0]`            |
| delete | `aws_cloudwatch_query_definition.pinpoint-logs[0]`                                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.pinpoint-sms-failures-carriers[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint-sms-failures-carriers" {
      + id             = (known after apply)
      + log_group_name = (sensitive value)
      + name           = "pinpoint-sms-failures-carriers"
      + pattern        = "{ ($.isFinal IS TRUE) && ($.carrierName != \"\" && ( ($.messageStatus != \"SUCCESSFUL\") && ($.messageStatus != \"DELIVERED\") )) }"

      + metric_transformation {
          + dimensions = {
              + "Carrier" = "$.carrierName"
            }
          + name       = "pinpoint-sms-failures-carriers"
          + namespace  = "LogMetrics"
          + unit       = "None"
          + value      = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-bell-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-bell-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for Bell Cellular Inc. / Aliant Telecom."
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "Bell Cellular Inc. / Aliant Telecom"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-bragg-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-bragg-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for BRAGG Communications INC."
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "BRAGG Communications INC."
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-freedom-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-freedom-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for Freedom Mobile Inc."
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "Freedom Mobile Inc."
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-iristel-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-iristel-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for Iristel Inc."
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "Iristel Inc."
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-maritime-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-maritime-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for Maritime Telephone & Telegraph Ltd."
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "Maritime Telephone & Telegraph Ltd"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-mts-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-mts-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for MTS Communications Inc."
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "MTS Communications Inc."
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-rogers-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-rogers-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for Rogers Communications Canada Inc."
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "Rogers Communications Canada Inc."
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-telus-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-telus-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for Telus Communications"
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "Telus Communications"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pinpoint-sms-failures-videotron-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-failures-videotron-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Pinpoint SMS failures are more than 50 for Videotron Ltd."
      + alarm_name                            = "pinpoint-sms-failures-telus-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Carrier" = "Videotron Ltd."
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-failures-carriers"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.pinpoint-logs[0] will be destroyed
  # (because aws_cloudwatch_query_definition.pinpoint-logs is not in configuration)
  - resource "aws_cloudwatch_query_definition" "pinpoint-logs" {
      - id                  = "3c055307-3799-4600-8521-98a558a484db" -> null
      - log_group_names     = [
          - (sensitive value),
        ] -> null
      - name                = "SMS / Pinpoint logs" -> null
      - query_definition_id = "3c055307-3799-4600-8521-98a558a484db" -> null
      - query_string        = <<-EOT
            fields @timestamp, destinationPhoneNumber, messageStatus, messageStatusDescription, @logStream
            | filter isFinal
            | sort @timestamp desc
            | limit 100
        EOT -> null
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-blocked-as-spam[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-blocked-as-spam" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Block as spam"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter isFinal
            | filter eventType = 'TEXT_SPAM'
            | sort Timestamp desc
            | limit 100
            }
        EOT
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-carrier-dwell-times[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-carrier-dwell-times" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Carrier dwell times"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            stats avg((eventTimestamp - messageRequestTimestamp) / 1000 / 60) as Avg_carrier_time_minutes,
            count(*) as Number by carrierName as Carrier
            | filter isFinal
            | sort by Avg_carrier_time_minutes desc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-failures-by-carrier[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-failures-by-carrier" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Failures by carrier"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter isFinal
            | filter messageStatus not like /DELIVERED|SUCCESSFUL/
            | stats count(*) as Total by coalesce(carrierName, 'Unknown/VOIP') as Carrier, messageStatus as MessageStatus
            | sort by Total desc
        EOT
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-get-failures[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-get-failures" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Get failures"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter isFinal
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-get-logs[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-get-logs" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Logs"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter isFinal
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-get-sms-logs-by-dest-phone-number[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-get-sms-logs-by-dest-phone-number" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Get SMS logs by destination phone number"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter destinationPhoneNumber like '+1416xxxxxxx'
            | sort Timestamp desc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-get-sms-logs-by-orig-phone-number[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-get-sms-logs-by-orig-phone-number" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Get SMS logs by origination phone number"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter originationPhoneNumber like '237762'
            | sort Timestamp desc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-international-sending-status[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-international-sending-status" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / International sending status"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message
            | parse @message /"isoCountryCode":"(?<Country>[^"]+)"/
            | parse @message /"eventType":"(?<Event_Type>[^"]+)"/
            | parse @message /"isFinal":(?<Is_Final>\w+)/
            | filter Is_Final = "true"
            | stats count(*) as Event_Count by Country, Event_Type
            | display Country, Event_Type, Event_Count
            | sort Country asc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.pinpoint-sms-success-vs-unreachable[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-sms-success-vs-unreachable" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Success vs Unreachable"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | parse messageStatusDescription "Phone is currently unreachable/*" as @unavailable
            | parse messageStatusDescription "Message has been * by phone" as @available
            | stats count(@unavailable) as Unavailable, count(@available) as Available, count(*) as Total by bin(1h)
        EOT
    }

Plan: 19 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.pinpoint_to_sqs_sms_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-blocked-as-spam-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-failures-bell-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-failures-bragg-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-failures-freedom-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-failures-iristel-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-failures-maritime-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-failures-mts-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-failures-rogers-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pinpoint-sms-failures-telus-warning[0]"]
WARN - plan.json - main - Missing...
```

</details>
